Key_Scale = [
    ["大大吉",  80      ],
    ["大吉",    75<=79  ],
    ["中吉",    60<=74  ],
    ["小吉",    45<=59  ],
    ["吉",      26<=44  ],
    ["凶",      11<=25  ],
    ["大凶",    1<=10   ],
    ["大大凶",  0       ]
]

Lucky_Weight = [
    1,
    5,
    10,
    12,
    14,
    15,
    14,
    12,
    10,
    5,
    2
]

Items = [
    {"Wish":[
        ["びっくりするほど叶わない\n考えるだけ無駄なので早く諦めること"],
        ["叶わない\n出直せ"],
        ["並外れた努力をしなければなにも叶わない\nつま先までラストチャンスに飢えること"],
        ["願事に対する気持ちが足りていない\n叶うものも叶わない"],
        ["いつでも叶うもの以外基本叶わない\n身の程を弁えて願うこと"],
        ["ちょっとよく分からないですね\n努力すれば良いんじゃないでしょうか"],
        ["穏やかに過ごせば少しは叶う\n欲を持ちすぎないように"],
        ["7割叶う\n3割に思いを馳せないこと"],
        ["叶うが選択を迫られる\n冷静に対処すること"],
        ["叶う\n座して待て"],
        ["願事より良い形で全て叶う\nすごいイイ感じになる"]
    ]},
    {"Lost":[
        ["もうどこにも無い\n考えるだけ無駄なので早く諦めること"],
        ["失くす方が悪い\n出直せ"],
        ["既に他人の物\n涙は拭くこと"],
        ["50年くらい探せば見つかる\n必死に探すこと"],
        ["実はもう見つけている\nださ"],
        ["ちょっとよく分からないですね\n探せば見つかるんじゃないですか"],
        ["近くにある\nたぶん気づかない"],
        ["ふとした時に見つかる\n但しその前により良いものが手に入る"],
        ["近々見つかる\n穏やかに待て"],
        ["必ず見つかる\n座して待て"],
        ["全て状態良く見つかる\nなんなら3倍くらいに増える"]
    ]},
    {"Travel":[
        ["行くも止めるも最悪の日になる\n考えるだけ無駄なので早く諦めること"],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""]
    ]},
    {"Business":[
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""]
    ]},
    {"Study":[
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""]
    ]},
    {"Dispute":[
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""]
    ]},
    {"Draw":[
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""]
    ]},
    {"Aim":[
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""]
    ]},
    {"Direction":[
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""],
        [""]
    ]},
]

