sp3_wpn_all = [
  #############################################################
  # シューター
  ## 1.0.0
  [
    "シューター", "わかばシューター", "スプラッシュボム", "グレートバリア",
    "https://img.game8.jp/7148627/09d5a8b68bbba723e7c88a1714426861.png/show"
  ],
  [
    "シューター", "スプラシューター", "キューバンボム", "ウルトラショット",
    "https://img.game8.jp/7148643/4e06ead46c6555012efe69eb304a7a05.png/show"
  ],
  [
    "シューター", "ボールドマーカー", "カーリングボム", "ウルトラハンコ",
    "https://img.game8.jp/7148618/eb18396687d5d85388992084b7787198.png/show"
  ],
  [
    "シューター", "シャープマーカー", "クイックボム", "カニタンク",
    "https://img.game8.jp/7148600/0c66d7d2fa119eb20bced330b9aeb035.png/show"
  ],
  [
    "シューター", "プロモデラーMG", "タンサンボム", "サメライド",
    "https://img.game8.jp/7148609/cfc5a5064b90a59b70537a65312c0755.png/show"
  ],
  [
    "シューター", "N-ZAP85", "キューバンボム", "エナジースタンド",
    "https://img.game8.jp/7148602/316e55e56eaa4df73e4867b2fab4e4ec.png/show"
  ],
  [
    "シューター", "プライムシューター", "ラインマーカー", "カニタンク",
    "https://img.game8.jp/7148617/ff4b56f2126407af71a12e1cd383edc1.png/show"
  ],
  [
    "シューター", ".52ガロン", "スプラッシュシールド", "メガホンレーザー5.1ch",
    "https://img.game8.jp/7148594/c0d4f5dc565d07d0cd242d805872cd58.png/show"
  ],
  [
    "シューター", ".96ガロン", "スプリンクラー", "キューインキ",
    "https://img.game8.jp/7148593/27085e4df514d879cd658dd1e117af08.png/show"
  ],
  [
    "シューター", "L3リールガン", "カーリングボム", "カニタンク",
    "https://img.game8.jp/7158592/947a5aaccff5af4b56e3a67479c1034c.png/show"
  ],
  [
    "シューター", "H3リールガン", "ポイントセンサー", "エナジースタンド",
    "https://img.game8.jp/7158594/710adc47626c626c8f1d934d1137ad0b.png/show"
  ],
  [
    "シューター", "ジェットスイーパー", "ラインマーカー", "キューインキ",
    "https://img.game8.jp/7148641/1e02d396f45617c29a3adee2150cacdc.png/show"
  ],
  ## 2.0.0
  [
    "シューター", "もみじシューター", "トーピード", "ホップソナー",
    "https://img.game8.jp/7495588/cde90b4a4941271210bbd709e57c272b.png/show"
  ],
  [
    "シューター", "スプラシューターコラボ", "スプラッシュボム", "トリプルトルネード",
    "https://img.game8.jp/7495587/675e167855f0a04ade8c7ed0ff779b04.png/show"
  ],
  [
    "シューター", "プロモデラーRG", "スプリンクラー", "ナイスダマ",
    "https://img.game8.jp/7495589/ca7b90870078eb9e6d4f21bb0dd41dee.png/show"
  ],
  [
    "シューター", "プライムシューターコラボ", "キューバンボム", "ナイスダマ",
    "https://img.game8.jp/7495598/52cde296df562ffe145f2c6f6a84f613.png/show"
  ],
  [
    "シューター", "スペースシューター", "ポイントセンサー", "メガホンレーザー5.1ch",
    "https://img.game8.jp/7495591/2cee92461905fc08f5190b14bf0daa1c.png/show"
  ],
  ## 3.0.0
  [
    "シューター", "ボールドマーカーネオ", "ジャンプビーコン", "メガホンレーザー5.1ch",
    "https://img.game8.jp/7805299/3f83f1b384fac121765089a4028f5e96.png/show"
  ],
  [
    "シューター", "シャープマーカーネオ", "キューバンボム", "トリプルトルネード",
    "https://img.game8.jp/7805289/e3fc57e1b04da22ec567c873860955f8.png/show"
  ],
  [
    "シューター", "N-ZAP89", "ロボットボム", "デコイチラシ",
    "https://img.game8.jp/7805262/d028f830d6abb69162fecc79c56d6047.png/show"
  ],
  [
    "シューター", ".96ガロンデコ", "スプラッシュシールド", "テイオウイカ",
    "https://img.game8.jp/7805258/be4a802485f9d47676d22c0696bcc100.png/show"
  ],
  [
    "シューター", "L3リールガンD", "クイックボム", "ウルトラハンコ",
    "https://img.game8.jp/7805274/032ccc5508e6a61026a805b54622cf59.png/show"
  ],
  [
    "シューター", "ジェットスイーパーカスタム", "ポイズンミスト", "アメフラシ",
    "https://img.game8.jp/7805293/71533755ec22bd83495a284056b69cd6.png/show"
  ],
  ## 4.0.0
  [
    "シューター", "H3リールガンD", "スプラッシュシールド", "グレートバリア", 
    "https://img.game8.jp/8111112/db839133703a4340f35be209cdc39eed.png/show"
  ],
  [
    "シューター", "スペースシューターコラボ", "トラップ", "ジェットパック", 
    "https://img.game8.jp/8111087/7e9cd6b40b5f9f4a866107744fef9cf5.png/show"
  ],
  
  #############################################################
  # ローラー
  ## 1.0.0
  [
    "ローラー", "カーボンローラー", "ロボットボム", "ショクワンダー",
    "https://img.game8.jp/7158596/b1018c374eaa935c887f76c93273ac86.png/show"
  ],
  [
    "ローラー", "スプラローラー", "カーリングボム", "グレートバリア",
    "https://img.game8.jp/7148614/572c38d3ef656ea9b78b6e2ec50a2c2b.png/show"
  ],
  [
    "ローラー", "ダイナモローラー", "スプリンクラー", "エナジースタンド",
    "https://img.game8.jp/7148625/6c7cbb9ffb432b83a9132f415d53b410.png/show"
  ],
  [
    "ローラー", "ヴァリアブルローラー", "トラップ", "マルチミサイル",
    "https://img.game8.jp/7148604/1451ddc947988ee9838ab655c351c590.png/show"
  ],
  ## 2.0.0
  [
    "ローラー", "カーボンローラーデコ", "クイックボム", "ウルトラショット",
    "https://img.game8.jp/7495595/cff19021d3d821c7063251eacf91a130.png/show"
  ],
  [
    "ローラー", "ワイドローラー", "スプラッシュシールド", "キューインキ",
    "https://img.game8.jp/7495590/3e13e7fe95057d1f75604bcdbd8b08fb.png/show"
  ],
  ## 3.0.0
  [
    "ローラー", "スプラローラーコラボ", "ジャンプビーコン", "テイオウイカ",
    "https://img.game8.jp/7805257/3530d25a77799328ab3ac198e8257a38.png/show"
  ],
  ## 4.0.0
  [
    "ローラー", "ワイドローラーコラボ", "ラインマーカー", "アメフラシ", 
    "https://img.game8.jp/8111099/f1404a52a861ec1a90d2c781eaf0c5fe.png/show"
  ],
  ## 5.0.0
  #[
  #  "ローラー", "ダイナモローラーテスラ", "スプラッシュボム", "デコイチラシ",
  #  ""
  #],
  
  #############################################################
  # チャージャー
  ## 1.0.0
  [
    "チャージャー", "スプラチャージャー", "スプラッシュボム", "キューインキ",
    "https://img.game8.jp/7148610/f867d05747c2af70da4e2ee71f65f6f8.png/show"
  ],
  [
    "チャージャー", "スプラスコープ", "スプラッシュボム", "キューインキ",
    "https://img.game8.jp/7148623/eaa9118201d3e1c04270e6dea43b19a9.png/show"
  ],
  [
    "チャージャー", "スクイックリンα", "ポイントセンサー", "グレートバリア",
    "https://img.game8.jp/7148631/db83352071b5dd7a630b85a6e9e2e2ba.png/show"
  ],
  [
    "チャージャー", "リッター4K", "トラップ", "ホップソナー",
    "https://img.game8.jp/7148616/e439af25bab82fc7448a25e44f186c8f.png/show"
  ],
  [
    "チャージャー", "4Kスコープ", "トラップ", "ホップソナー",
    "https://img.game8.jp/7148634/36064e1be6436357fd4b82cfdaf14945.png/show"
  ],
  [
    "チャージャー", "14式竹筒銃・甲", "ロボットボム", "メガホンレーザー5.1ch",
    "https://img.game8.jp/7158590/82dff8d9a64dc11f5f8b1e1ed9d75b4b.png/show"
  ],
  [
    "チャージャー", "ソイチューバー", "トーピード", "マルチミサイル",
    "https://img.game8.jp/7158875/18f33ff466d7e0a2ce2256fac1d7e752.png/show"
  ],
  ## 2.0.0
  [
    "チャージャー", "R-PEN/5H", "スプリンクラー", "エナジースタンド",
    "https://img.game8.jp/7495592/ba433b581dbc5d58795f881d36167894.png/show"
  ],
  ## 3.0.0
  [
    "チャージャー", "スプラチャージャーコラボ", "スプラッシュシールド", "トリプルトルネード",
    "https://img.game8.jp/7805268/4abed768445a8ee9fb52f2c44109d0a9.png/show"
  ],
  [
    "チャージャー", "スプラスコープコラボ", "スプラッシュシールド", "トリプルトルネード",
    "https://img.game8.jp/7805272/a838bce961e48d2adf62c47149061356.png/show"
  ],
  ## 5.0.0
  #[
  #  "チャージャー", "ソイチューバーカスタム", "タンサンボム", "ウルトラハンコ",
  #  ""
  #],
  
  #############################################################
  # スピナー
  ## 1.0.0
  [
    "スピナー", "バレルスピナー", "スプリンクラー", "ホップソナー",
    "https://img.game8.jp/7148612/f07dec1cf225b05848ad6232e4df30fc.png/show"
  ],
  [
    "スピナー", "スプラスピナー", "クイックボム", "ウルトラハンコ",
    "https://img.game8.jp/7158616/9d1e1d13ceef6458d128b571a5fb2269.png/show"
  ],
  [
    "スピナー", "ハイドラント", "ロボットボム", "ナイスダマ",
    "https://img.game8.jp/7148621/30bb568f12b4457c59e1d3fd85ccd754.png/show"
  ],
  [
    "スピナー", "ノーチラス47", "ポイントセンサー", "アメフラシ",
    "https://img.game8.jp/7158607/18f310a126aee708e1cc136ea92d9388.png/show"
  ],
  [
    "スピナー", "クーゲルシュライバー", "タンサンボム", "ジェットパック",
    "https://img.game8.jp/7158595/0963f84527306ca195019bbb78888809.png/show"
  ],
  ## 2.0.0
  [
    "スピナー", "スプラスピナーコラボ", "ポイズンミスト", "グレートバリア",
    "https://img.game8.jp/7495596/5f1222656f792c5a338dced465e8db42.png/show"
  ],
  ## 4.0.0
  [
    "スピナー", "バレルスピナーデコ", "ポイントセンサー", "テイオウイカ", 
    "https://img.game8.jp/8111095/d8333621af2d533d9c45c6691686076b.png/show"
  ],
  ## 5.0.0
  #[
  #  "スピナー", "クーゲルシュライバーヒュー", "トラップ", "キューインキ",
  #  ""
  #],
  #[
  #  "スピナー", "イグザミナー", "カーリングボム", "エナジースタンド",
  #  ""
  #],
  
  #############################################################
  # ブラスター
  ## 1.0.0
  [
    "ブラスター", "ホットブラスター", "ロボットボム", "グレートバリア",
    "https://img.game8.jp/7148628/e7284a4a8c67eae74c6b3c3b56cbbafe.png/show"
  ],
  [
    "ブラスター", "ロングブラスター", "キューバンボム", "ホップソナー",
    "https://img.game8.jp/7148636/f7af7bcc5f2f2addf986e76ab31daea0.png/show"
  ],
  [
    "ブラスター", "ラピッドブラスター", "トラップ", "トリプルトルネード",
    "https://img.game8.jp/7158606/011d9e678754a1aaf230dd2cae9d5b56.png/show"
  ],
  [
    "ブラスター", "Rブラスターエリート", "ポイズンミスト", "キューインキ",
    "https://img.game8.jp/7158593/922df3d936a7e045e9b5973ae7cf8ef1.png/show"
  ],
  [
    "ブラスター", "ノヴァブラスター", "スプラッシュボム", "ショクワンダー",
    "https://img.game8.jp/7148622/d9f9c73053cf62a68f64ffdb978bc8d9.png/show"
  ],
  [
    "ブラスター", "クラッシュブラスター", "スプラッシュボム", "ウルトラショット",
    "https://img.game8.jp/7158597/5b49e333dc22fb4da27056410f7aed72.png/show"
  ],
  ## 2.0.0
  [
    "ブラスター", "ノヴァブラスターネオ", "タンサンボム", "ウルトラハンコ",
    "https://img.game8.jp/7495594/9ecaeae7626b4463d697bdb65ac5b2c6.png/show"
  ],
  ## 3.0.0
  [
    "ブラスター", "ラピッドブラスターデコ", "トーピード", "ジェットパック",
    "https://img.game8.jp/7805283/3a62ddd6e0896a63816c1e31a1d71687.png/show"
  ],
  [
    "ブラスター", "クラッシュブラスターネオ", "カーリングボム", "デコイチラシ",
    "https://img.game8.jp/7805264/874bc59b22d03933428a3a71750698b7.png/show"
  ],
  ## 4.0.0
  [
    "ブラスター", "Rブラスターエリートデコ", "ラインマーカー", "メガホンレーザー5.1ch", 
    "https://img.game8.jp/8111115/2dada8f38ea12b5c09afcd9ef090fd76.png/show"
  ],
  
  #############################################################
  # フデ
  ## 1.0.0
  [
    "フデ", "パブロ", "スプラッシュボム", "メガホンレーザー5.1ch",
    "https://img.game8.jp/7148608/2e0eebe74944b411f32bb39edecb9f27.png/show"
  ],
  [
    "フデ", "ホクサイ", "キューバンボム", "ショクワンダー",
    "https://img.game8.jp/7148615/5cae276144e2243fd5aa84a593798c20.png/show"
  ],
  ## 2.0.0
  [
    "フデ", "パブロ・ヒュー", "トラップ", "ウルトラハンコ",
    "https://img.game8.jp/7495597/e904a46e7b53d5cee0ded48b554b6a23.png/show"
  ],
  ## 5.0.0
  #[
  #  "フデ", "ホクサイ・ヒュー", "ジャンプビーコン", "アメフラシ",
  #  ""
  #],
  
  #############################################################
  # スロッシャー
  ## 1.0.0
  [
    "スロッシャー", "バケットスロッシャー", "スプラッシュボム", "トリプルトルネード",
    "https://img.game8.jp/7148632/ae16f76fbcd89ec2ef2394386e61f9b0.png/show"
  ],
  [
    "スロッシャー", "ヒッセン", "ポイズンミスト", "ジェットパック",
    "https://img.game8.jp/7148637/292fadcef5d154f1b016ae76b305e72e.png/show"
  ],
  [
    "スロッシャー", "スクリュースロッシャー", "タンサンボム", "ナイスダマ",
    "https://img.game8.jp/7158608/430982c19701243004f68dd4026200d7.png/show"
  ],
  [
    "スロッシャー", "オーバーフロッシャー", "スプリンクラー", "アメフラシ",
    "https://img.game8.jp/7158591/41a9e3ec14ee99e022b3880df4de4569.png/show"
  ],
  [
    "スロッシャー", "エクスプロッシャー", "ポイントセンサー", "アメフラシ",
    "https://img.game8.jp/7148619/2a418cddc4733bffe76283a9b60ac7db.png/show"
  ],
  ## 2.0.0
  [
    "スロッシャー", "バケットスロッシャーデコ", "ラインマーカー", "ショクワンダー",
    "https://img.game8.jp/7495599/811df48a3ad21d1bd7375068980722c0.png/show"
  ],
  ## 3.0.0
  [
    "スロッシャー", "ヒッセン・ヒュー", "タンサンボム", "エナジースタンド",
    "https://img.game8.jp/7805296/d8ce82ad7e8f32fda673f3b661955d44.png/show"
  ],
  ## 5.0.0
  #[
  #  "スロッシャー", "スクリュースロッシャーネオ", "ポイントセンサー", "ウルトラショット",
  #  ""
  #],
  #[
  #  "スロッシャー", "オーバーフロッシャーデコ", "ラインマーカー", "テイオウイカ",
  #  ""
  #],
  #[
  #  "スロッシャー", "モップリン", "キューバンボム", "サメライド",
  #  ""
  #],
  
  #############################################################
  # シェルター
  ## 1.0.0
  [
    "シェルター", "パラシェルター", "スプリンクラー", "トリプルトルネード",
    "https://img.game8.jp/7148629/9fb80ab48c4a4ac8068ffcfcd52b16dc.png/show"
  ],
  [
    "シェルター", "キャンピングシェルター", "ジャンプビーコン", "キューインキ",
    "https://img.game8.jp/7148639/2bb2395bf138ee8a5bb8b03b3c6dc18c.png/show"
  ],
  [
    "シェルター", "スパイガジェット", "トラップ", "サメライド",
    "https://img.game8.jp/7148611/bab35fcb26cd453c1140d626a06115cb.png/show"
  ],
  ## 4.0.0
  [
    "シェルター", "キャンピングシェルターソレーラ", "トラップ", "ウルトラショット",
    "https://img.game8.jp/8111106/77b5bbd70c43089fb4226d7284bd9234.png/show"
  ],
  ## 5.0.0
  #[
  #  "シェルター", "パラシェルターソレーラ", "ロボットボム", "ジェットパック",
  #  ""
  #],
  
  #############################################################
  # ワイパー
  ## 1.0.0
  [
    "ワイパー", "ドライブワイパー", "トーピード", "ウルトラハンコ",
    "https://img.game8.jp/7148642/203c086b3609750b77b76a0de6f09c58.png/show"
  ],
  [
    "ワイパー", "ジムワイパー", "クイックボム", "ショクワンダー",
    "https://img.game8.jp/7148595/509e22e3f7dae7d0c5db0f5da5d752f2.png/show"
  ],
  [
    "ワイパー", "ドライブワイパーデコ", "ジャンプビーコン", "マルチミサイル",
    "https://img.game8.jp/8111082/82f0b1a651eb0a4aadd3bbc23122fb65.png/show"
  ],
  
  #############################################################
  # マニューバー
  ## 1.0.0
  [
    "マニューバー", "スプラマニューバー", "キューバンボム", "カニタンク",
    "https://img.game8.jp/7148620/ec62c29e14276198165a0f3aea39c026.png/show"
  ],
  [
    "マニューバー", "デュアルスイーパー", "スプラッシュボム", "ホップソナー",
    "https://img.game8.jp/7148635/3b7e7ee467d11a6d6d83027331e88178.png/show"
  ],
  [
    "マニューバー", "スパッタリー", "ジャンプビーコン", "エナジースタンド",
    "https://img.game8.jp/7148606/47525c2d4562dac86acd5292a925f750.png/show"
  ],
  [
    "マニューバー", "クアッドホッパーブラック", "ロボットボム", "サメライド",
    "https://img.game8.jp/7148603/3d40b0ba16c6aaacd3dd6d3cc35c6bc3.png/show"
  ],
  [
    "マニューバー", "ケルビン525", "スプラッシュシールド", "ナイスダマ",
    "https://img.game8.jp/7199997/4a19fc984a7dfb16bf951a9275ccf2a6.png/show"
  ],
  ## 2.0.0
  [
    "マニューバー", "スパッタリー・ヒュー", "トーピード", "サメライド",
    "https://img.game8.jp/7495593/b25c02a3bb322e1f7f0815e5e93fbd16.png/show"
  ],
  ## 4.0.0
  [
    "マニューバー", "デュアルスイーパーカスタム", "ジャンプビーコン", "デコイチラシ",
    "https://img.game8.jp/8111098/8feaf98d4f560c92820e8533b5dcdc8e.png/show"
  ],
  [
    "マニューバー", "クアッドホッパーホワイト", "スプリンクラー", "ショクワンダー",
    "https://img.game8.jp/8111110/4c390b58c4308ce2aba5f86daeddccc4.png/show"
  ],
  
  #############################################################
  # ストリンガー
  ## 1.0.0
  [
    "ストリンガー", "トライストリンガー", "ポイズンミスト", "メガホンレーザー5.1ch",
    "https://img.game8.jp/7148630/2965b18f45d24db147aaf75093ee57b7.png/show"
  ],
  [
    "ストリンガー", "LACT-450", "カーリングボム", "マルチミサイル",
    "https://img.game8.jp/7199998/390f4a0b68ab51d89cb81bd13327fa1d.png/show"
  ],
  ## 5.0.0
  #[
  #  "ストリンガー", "トライストリンガーコラボ", "スプリンクラー", "デコイチラシ",
  #  ""
  #],
]